Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 56, 2)]  0                                            
__________________________________________________________________________________________________
conv-layer-0 (CoordConv2D)      (None, 14, 28, 32)   1184        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2 (BatchNo (None, 14, 28, 32)   128         conv-layer-0[0][0]               
__________________________________________________________________________________________________
activation (Activation)         (None, 14, 28, 32)   0           batch_normalization_v2[0][0]     
__________________________________________________________________________________________________
conv-layer-1 (CoordConv2D)      (None, 7, 14, 32)    9824        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_v2_1 (Batch (None, 7, 14, 32)    128         conv-layer-1[0][0]               
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 7, 14, 32)    0           batch_normalization_v2_1[0][0]   
__________________________________________________________________________________________________
conv-layer-2 (CoordConv2D)      (None, 4, 7, 64)     19648       activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_2 (Batch (None, 4, 7, 64)     256         conv-layer-2[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 4, 7, 64)     0           batch_normalization_v2_2[0][0]   
__________________________________________________________________________________________________
conv-layer-3 (CoordConv2D)      (None, 2, 4, 64)     38080       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_3 (Batch (None, 2, 4, 64)     256         conv-layer-3[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 2, 4, 64)     0           batch_normalization_v2_3[0][0]   
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 512)          0           activation_3[0][0]               
__________________________________________________________________________________________________
encoder-prev-fc (Dense)         (None, 256)          131328      encoder-flatten[0][0]            
__________________________________________________________________________________________________
encoder-last-fc (Dense)         (None, 32)           8224        encoder-prev-fc[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 16)           528         encoder-last-fc[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           528         encoder-last-fc[0][0]            
==================================================================================================
Total params: 210,112
Trainable params: 209,728
Non-trainable params: 384
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 16)]         0                                            
__________________________________________________________________________________________________
decoder-first-fc (Dense)        (None, 512)          8704        input_2[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 2, 4, 64)     0           decoder-first-fc[0][0]           
__________________________________________________________________________________________________
transp-conv-layer-0 (CoordConv2 (None, 4, 8, 64)     38080       reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2_4 (Batch (None, 4, 8, 64)     256         transp-conv-layer-0[0][0]        
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 4, 8, 64)     0           batch_normalization_v2_4[0][0]   
__________________________________________________________________________________________________
cropping2d (Cropping2D)         (None, 4, 7, 64)     0           activation_4[0][0]               
__________________________________________________________________________________________________
transp-conv-layer-1 (CoordConv2 (None, 8, 14, 64)    38080       cropping2d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_v2_5 (Batch (None, 8, 14, 64)    256         transp-conv-layer-1[0][0]        
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 8, 14, 64)    0           batch_normalization_v2_5[0][0]   
__________________________________________________________________________________________________
cropping2d_1 (Cropping2D)       (None, 7, 14, 64)    0           activation_5[0][0]               
__________________________________________________________________________________________________
transp-conv-layer-2 (CoordConv2 (None, 14, 28, 32)   19040       cropping2d_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_6 (Batch (None, 14, 28, 32)   128         transp-conv-layer-2[0][0]        
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 14, 28, 32)   0           batch_normalization_v2_6[0][0]   
__________________________________________________________________________________________________
transp-conv-layer-3 (CoordConv2 (None, 28, 56, 32)   9824        activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_7 (Batch (None, 28, 56, 32)   128         transp-conv-layer-3[0][0]        
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 28, 56, 32)   0           batch_normalization_v2_7[0][0]   
__________________________________________________________________________________________________
decoder-image (CoordConv2D)     (None, 28, 56, 1)    35          activation_7[0][0]               
__________________________________________________________________________________________________
decoder-raw-confidence (CoordCo (None, 28, 56, 1)    35          activation_7[0][0]               
==================================================================================================
Total params: 114,566
Trainable params: 114,182
Non-trainable params: 384
__________________________________________________________________________________________________
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            [(None, 28, 56, 2)]  0                                            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 28, 56, 32)   576         input_7[0][0]                    
__________________________________________________________________________________________________
instance_normalization (Instanc (None, 28, 56, 32)   32          conv2d_12[0][0]                  
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 28, 56, 32)   0           instance_normalization[0][0]     
__________________________________________________________________________________________________
resize/ResizeNearestNeighbor (T [(None, 14, 28, 32)] 0           re_lu[0][0]                      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 14, 28, 32)   9216        resize/ResizeNearestNeighbor[0][0
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 14, 28, 32)   32          conv2d_13[0][0]                  
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 14, 28, 32)   0           instance_normalization_1[0][0]   
__________________________________________________________________________________________________
resize_1/ResizeNearestNeighbor  [(None, 7, 14, 32)]  0           re_lu_1[0][0]                    
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 7, 14, 64)    18432       resize_1/ResizeNearestNeighbor[0]
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 7, 14, 64)    64          conv2d_14[0][0]                  
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 7, 14, 64)    0           instance_normalization_2[0][0]   
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6272)         0           re_lu_2[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 32)           200736      flatten[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 32)           1056        dense_6[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 6272)         206976      dense_7[0][0]                    
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 7, 14, 64)    0           dense_8[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 7, 14, 128)   0           reshape_3[0][0]                  
                                                                 re_lu_2[0][0]                    
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 7, 14, 64)    73728       concatenate[0][0]                
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 7, 14, 64)    64          conv2d_15[0][0]                  
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 7, 14, 64)    0           instance_normalization_3[0][0]   
__________________________________________________________________________________________________
resize_2/ResizeNearestNeighbor  [(None, 14, 28, 64)] 0           re_lu_3[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 14, 28, 96)   0           resize_2/ResizeNearestNeighbor[0]
                                                                 re_lu_1[0][0]                    
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 14, 28, 32)   27648       concatenate_1[0][0]              
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 14, 28, 32)   32          conv2d_16[0][0]                  
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 14, 28, 32)   0           instance_normalization_4[0][0]   
__________________________________________________________________________________________________
resize_3/ResizeNearestNeighbor  [(None, 28, 56, 32)] 0           re_lu_4[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 28, 56, 64)   0           resize_3/ResizeNearestNeighbor[0]
                                                                 re_lu[0][0]                      
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 28, 56, 32)   18432       concatenate_2[0][0]              
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 28, 56, 32)   32          conv2d_17[0][0]                  
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 28, 56, 32)   0           instance_normalization_5[0][0]   
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 28, 56, 1)    33          re_lu_5[0][0]                    
__________________________________________________________________________________________________
zeros_like (TensorFlowOpLayer)  [(None, 28, 56, 1)]  0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 28, 56, 2)    0           conv2d_18[0][0]                  
                                                                 zeros_like[0][0]                 
__________________________________________________________________________________________________
LogSoftmax (TensorFlowOpLayer)  [(None, 28, 56, 2)]  0           concatenate_3[0][0]              
==================================================================================================
Total params: 557,089
Trainable params: 557,089
Non-trainable params: 0
__________________________________________________________________________________________________
