Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 28, 56, 1),  82122       input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 28, 56, 1),  82122       input_1[0][0]                    
__________________________________________________________________________________________________
VAE-2 (VAE)                     [(None, 28, 56, 1),  82122       input_1[0][0]                    
__________________________________________________________________________________________________
VAE-3 (VAE)                     [(None, 28, 56, 1),  82122       input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(4, None, 28, 56, 1 0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
                                                                 VAE-2[0][1]                      
                                                                 VAE-3[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (4, None, 28, 56, 1) 0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(4, None, 28, 56, 1 0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
                                                                 VAE-2[0][0]                      
                                                                 VAE-3[0][0]                      
==================================================================================================
Total params: 328,488
Trainable params: 328,296
Non-trainable params: 192
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
conv-layer-0 (CoordConv2D)      (None, 14, 28, 4)    112         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2 (BatchNo (None, 14, 28, 4)    16          conv-layer-0[0][0]               
__________________________________________________________________________________________________
activation (Activation)         (None, 14, 28, 4)    0           batch_normalization_v2[0][0]     
__________________________________________________________________________________________________
conv-layer-1 (CoordConv2D)      (None, 7, 14, 8)     440         activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_v2_1 (Batch (None, 7, 14, 8)     32          conv-layer-1[0][0]               
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 7, 14, 8)     0           batch_normalization_v2_1[0][0]   
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 784)          0           activation_1[0][0]               
__________________________________________________________________________________________________
encoder-last-fc (Dense)         (None, 64)           50240       encoder-flatten[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           2080        encoder-last-fc[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           2080        encoder-last-fc[0][0]            
==================================================================================================
Total params: 55,000
Trainable params: 54,976
Non-trainable params: 24
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 32)]         0                                            
__________________________________________________________________________________________________
decoder-first-fc (Dense)        (None, 784)          25872       input_3[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 7, 14, 8)     0           decoder-first-fc[0][0]           
__________________________________________________________________________________________________
transp-conv-layer-0 (CoordConv2 (None, 14, 28, 8)    728         reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2_2 (Batch (None, 14, 28, 8)    32          transp-conv-layer-0[0][0]        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 14, 28, 8)    0           batch_normalization_v2_2[0][0]   
__________________________________________________________________________________________________
transp-conv-layer-1 (CoordConv2 (None, 28, 56, 4)    364         activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_3 (Batch (None, 28, 56, 4)    16          transp-conv-layer-1[0][0]        
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 28, 56, 4)    0           batch_normalization_v2_3[0][0]   
__________________________________________________________________________________________________
decoder-image (CoordConv2D)     (None, 28, 56, 1)    55          activation_3[0][0]               
__________________________________________________________________________________________________
decoder-raw-confidence (CoordCo (None, 28, 56, 1)    55          activation_3[0][0]               
==================================================================================================
Total params: 27,122
Trainable params: 27,098
Non-trainable params: 24
__________________________________________________________________________________________________
