Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 28, 56, 1),  81654       input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 28, 56, 1),  81654       input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(2, None, 28, 56, 1 0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (2, None, 28, 56, 1) 0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(2, None, 28, 56, 1 0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
==================================================================================================
Total params: 163,308
Trainable params: 163,212
Non-trainable params: 96
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
conv-layer-0 (Conv2D)           (None, 14, 28, 4)    40          input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 14, 28, 4)    16          conv-layer-0[0][0]               
__________________________________________________________________________________________________
activation (Activation)         (None, 14, 28, 4)    0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv-layer-1 (Conv2D)           (None, 7, 14, 8)     296         activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 7, 14, 8)     32          conv-layer-1[0][0]               
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 7, 14, 8)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 784)          0           activation_1[0][0]               
__________________________________________________________________________________________________
encoder-last-fc (Dense)         (None, 64)           50240       encoder-flatten[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           2080        encoder-last-fc[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           2080        encoder-last-fc[0][0]            
==================================================================================================
Total params: 54,784
Trainable params: 54,760
Non-trainable params: 24
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 32)]         0                                            
__________________________________________________________________________________________________
decoder-first-fc (Dense)        (None, 784)          25872       input_3[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 7, 14, 8)     0           decoder-first-fc[0][0]           
__________________________________________________________________________________________________
transp-conv-layer-0 (Conv2DTran (None, 14, 28, 8)    584         reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 14, 28, 8)    32          transp-conv-layer-0[0][0]        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 14, 28, 8)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
transp-conv-layer-1 (Conv2DTran (None, 28, 56, 4)    292         activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 28, 56, 4)    16          transp-conv-layer-1[0][0]        
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 28, 56, 4)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
decoder-image (Conv2DTranspose) (None, 28, 56, 1)    37          activation_3[0][0]               
__________________________________________________________________________________________________
decoder-raw-confidence (Conv2DT (None, 28, 56, 1)    37          activation_3[0][0]               
==================================================================================================
Total params: 26,870
Trainable params: 26,846
Non-trainable params: 24
__________________________________________________________________________________________________
