Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 28, 56, 1),  585730      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 28, 56, 1),  585730      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-2 (VAE)                     [(None, 28, 56, 1),  585730      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-3 (VAE)                     [(None, 28, 56, 1),  585730      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-4 (VAE)                     [(None, 28, 56, 1),  585730      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-5 (VAE)                     [(None, 28, 56, 1),  585730      input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(6, None, 28, 56, 1 0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
                                                                 VAE-2[0][1]                      
                                                                 VAE-3[0][1]                      
                                                                 VAE-4[0][1]                      
                                                                 VAE-5[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (6, None, 28, 56, 1) 0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(6, None, 28, 56, 1 0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
                                                                 VAE-2[0][0]                      
                                                                 VAE-3[0][0]                      
                                                                 VAE-4[0][0]                      
                                                                 VAE-5[0][0]                      
==================================================================================================
Total params: 3,514,380
Trainable params: 3,512,076
Non-trainable params: 2,304
__________________________________________________________________________________________________
Model: "Encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
layer-0 (Conv2D)                (None, 14, 28, 32)   320         input_2[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 14, 28, 32)   0           layer-0[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2 (BatchNo (None, 14, 28, 32)   128         activation[0][0]                 
__________________________________________________________________________________________________
layer-1 (Conv2D)                (None, 7, 14, 64)    18496       batch_normalization_v2[0][0]     
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 7, 14, 64)    0           layer-1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2_1 (Batch (None, 7, 14, 64)    256         activation_1[0][0]               
__________________________________________________________________________________________________
flatten (Flatten)               (None, 6272)         0           batch_normalization_v2_1[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           401472      flatten[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           1040        dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 16)           1040        dense[0][0]                      
==================================================================================================
Total params: 422,752
Trainable params: 422,560
Non-trainable params: 192
__________________________________________________________________________________________________
Model: "Decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 16)]         0                                            
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 6272)         106624      input_3[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 7, 14, 64)    0           dense_3[0][0]                    
__________________________________________________________________________________________________
layer-0 (Conv2DTranspose)       (None, 14, 28, 64)   36928       reshape[0][0]                    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 14, 28, 64)   0           layer-0[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2_2 (Batch (None, 14, 28, 64)   256         activation_2[0][0]               
__________________________________________________________________________________________________
layer-1 (Conv2DTranspose)       (None, 28, 56, 32)   18464       batch_normalization_v2_2[0][0]   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 28, 56, 32)   0           layer-1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2_3 (Batch (None, 28, 56, 32)   128         activation_3[0][0]               
__________________________________________________________________________________________________
image (Conv2DTranspose)         (None, 28, 56, 1)    289         batch_normalization_v2_3[0][0]   
__________________________________________________________________________________________________
confidence (Conv2DTranspose)    (None, 28, 56, 1)    289         batch_normalization_v2_3[0][0]   
==================================================================================================
Total params: 162,978
Trainable params: 162,786
Non-trainable params: 192
__________________________________________________________________________________________________
