Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 80, 120, 3)] 0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 80, 120, 3), 927244      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 80, 120, 3), 927244      input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(2, None, 80, 120,  0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (2, None, 80, 120, 1 0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(2, None, 80, 120,  0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
==================================================================================================
Total params: 1,854,488
Trainable params: 1,852,952
Non-trainable params: 1,536
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 80, 120, 3)] 0                                            
__________________________________________________________________________________________________
conv-layer-0 (CoordConv2D)      (None, 40, 60, 32)   1472        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2 (BatchNo (None, 40, 60, 32)   128         conv-layer-0[0][0]               
__________________________________________________________________________________________________
activation (Activation)         (None, 40, 60, 32)   0           batch_normalization_v2[0][0]     
__________________________________________________________________________________________________
conv-layer-1 (CoordConv2D)      (None, 20, 30, 32)   9824        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_v2_1 (Batch (None, 20, 30, 32)   128         conv-layer-1[0][0]               
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 20, 30, 32)   0           batch_normalization_v2_1[0][0]   
__________________________________________________________________________________________________
conv-layer-2 (CoordConv2D)      (None, 10, 15, 64)   19648       activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_2 (Batch (None, 10, 15, 64)   256         conv-layer-2[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 10, 15, 64)   0           batch_normalization_v2_2[0][0]   
__________________________________________________________________________________________________
conv-layer-3 (CoordConv2D)      (None, 5, 8, 64)     38080       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_3 (Batch (None, 5, 8, 64)     256         conv-layer-3[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 5, 8, 64)     0           batch_normalization_v2_3[0][0]   
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 2560)         0           activation_3[0][0]               
__________________________________________________________________________________________________
encoder-pre-fc (Dense)          (None, 256)          655616      encoder-flatten[0][0]            
__________________________________________________________________________________________________
encoder-last-fc (Dense)         (None, 32)           8224        encoder-pre-fc[0][0]             
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           1056        encoder-last-fc[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           1056        encoder-last-fc[0][0]            
==================================================================================================
Total params: 735,744
Trainable params: 735,360
Non-trainable params: 384
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 32)]         0                                            
__________________________________________________________________________________________________
decoder-first-fc (Dense)        (None, 2560)         84480       input_3[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 5, 8, 64)     0           decoder-first-fc[0][0]           
__________________________________________________________________________________________________
transp-conv-layer-0 (CoordConv2 (None, 10, 16, 64)   38080       reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2_4 (Batch (None, 10, 16, 64)   256         transp-conv-layer-0[0][0]        
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 10, 16, 64)   0           batch_normalization_v2_4[0][0]   
__________________________________________________________________________________________________
cropping2d (Cropping2D)         (None, 10, 15, 64)   0           activation_4[0][0]               
__________________________________________________________________________________________________
transp-conv-layer-1 (CoordConv2 (None, 20, 30, 64)   38080       cropping2d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_v2_5 (Batch (None, 20, 30, 64)   256         transp-conv-layer-1[0][0]        
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 20, 30, 64)   0           batch_normalization_v2_5[0][0]   
__________________________________________________________________________________________________
transp-conv-layer-2 (CoordConv2 (None, 40, 60, 32)   19040       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_6 (Batch (None, 40, 60, 32)   128         transp-conv-layer-2[0][0]        
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 40, 60, 32)   0           batch_normalization_v2_6[0][0]   
__________________________________________________________________________________________________
transp-conv-layer-3 (CoordConv2 (None, 80, 120, 32)  9824        activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_7 (Batch (None, 80, 120, 32)  128         transp-conv-layer-3[0][0]        
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 80, 120, 32)  0           batch_normalization_v2_7[0][0]   
__________________________________________________________________________________________________
decoder-image (CoordConv2D)     (None, 80, 120, 3)   921         activation_7[0][0]               
__________________________________________________________________________________________________
decoder-raw-confidence (CoordCo (None, 80, 120, 1)   307         activation_7[0][0]               
==================================================================================================
Total params: 191,500
Trainable params: 191,116
Non-trainable params: 384
__________________________________________________________________________________________________
