Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 128, 128, 3) 443660      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 128, 128, 3) 443660      input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(2, None, 128, 128, 0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (2, None, 128, 128,  0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(2, None, 128, 128, 0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
==================================================================================================
Total params: 887,320
Trainable params: 887,320
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
conv-layer-0 (CoordConv2D)      (None, 64, 64, 32)   1472        input_2[0][0]                    
__________________________________________________________________________________________________
activation (Activation)         (None, 64, 64, 32)   0           conv-layer-0[0][0]               
__________________________________________________________________________________________________
conv-layer-1 (CoordConv2D)      (None, 32, 32, 32)   9824        activation[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 32)   0           conv-layer-1[0][0]               
__________________________________________________________________________________________________
conv-layer-2 (CoordConv2D)      (None, 16, 16, 64)   19648       activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 16, 16, 64)   0           conv-layer-2[0][0]               
__________________________________________________________________________________________________
conv-layer-3 (CoordConv2D)      (None, 8, 8, 64)     38080       activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 8, 8, 64)     0           conv-layer-3[0][0]               
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 4096)         0           activation_3[0][0]               
__________________________________________________________________________________________________
encoder-last-fc (Dense)         (None, 32)           131104      encoder-flatten[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           1056        encoder-last-fc[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           1056        encoder-last-fc[0][0]            
==================================================================================================
Total params: 202,240
Trainable params: 202,240
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 32)]         0                                            
__________________________________________________________________________________________________
decoder-first-fc (Dense)        (None, 4096)         135168      input_3[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 8, 8, 64)     0           decoder-first-fc[0][0]           
__________________________________________________________________________________________________
transp-conv-layer-0 (CoordConv2 (None, 16, 16, 64)   38080       reshape[0][0]                    
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 16, 16, 64)   0           transp-conv-layer-0[0][0]        
__________________________________________________________________________________________________
transp-conv-layer-1 (CoordConv2 (None, 32, 32, 64)   38080       activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 64)   0           transp-conv-layer-1[0][0]        
__________________________________________________________________________________________________
transp-conv-layer-2 (CoordConv2 (None, 64, 64, 32)   19040       activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 64, 64, 32)   0           transp-conv-layer-2[0][0]        
__________________________________________________________________________________________________
transp-conv-layer-3 (CoordConv2 (None, 128, 128, 32) 9824        activation_6[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 128, 128, 32) 0           transp-conv-layer-3[0][0]        
__________________________________________________________________________________________________
decoder-image (CoordConv2D)     (None, 128, 128, 3)  921         activation_7[0][0]               
__________________________________________________________________________________________________
decoder-raw-confidence (CoordCo (None, 128, 128, 1)  307         activation_7[0][0]               
==================================================================================================
Total params: 241,420
Trainable params: 241,420
Non-trainable params: 0
__________________________________________________________________________________________________
