Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 28, 56, 1),  383970      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 28, 56, 1),  383970      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-2 (VAE)                     [(None, 28, 56, 1),  383970      input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(3, None, 28, 56, 1 0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
                                                                 VAE-2[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (3, None, 28, 56, 1) 0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(3, None, 28, 56, 1 0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
                                                                 VAE-2[0][0]                      
==================================================================================================
Total params: 1,151,910
Trainable params: 1,150,758
Non-trainable params: 1,152
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
conv-layer-0 (Conv2D)           (None, 14, 28, 32)   320         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 14, 28, 32)   128         conv-layer-0[0][0]               
__________________________________________________________________________________________________
conv-layer-1 (Conv2D)           (None, 7, 14, 64)    18496       batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 7, 14, 64)    256         conv-layer-1[0][0]               
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 6272)         0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
encoder-last-fc (Dense)         (None, 32)           200736      encoder-flatten[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 16)           528         encoder-last-fc[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           528         encoder-last-fc[0][0]            
==================================================================================================
Total params: 220,992
Trainable params: 220,800
Non-trainable params: 192
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 16)]         0                                            
__________________________________________________________________________________________________
decoder-first-fc (Dense)        (None, 6272)         106624      input_3[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 7, 14, 64)    0           decoder-first-fc[0][0]           
__________________________________________________________________________________________________
transp-conv-layer-0 (Conv2DTran (None, 14, 28, 64)   36928       reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 14, 28, 64)   256         transp-conv-layer-0[0][0]        
__________________________________________________________________________________________________
transp-conv-layer-1 (Conv2DTran (None, 28, 56, 32)   18464       batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 28, 56, 32)   128         transp-conv-layer-1[0][0]        
__________________________________________________________________________________________________
decoder-image (Conv2DTranspose) (None, 28, 56, 1)    289         batch_normalization_3[0][0]      
__________________________________________________________________________________________________
decoder-raw-confidence (Conv2DT (None, 28, 56, 1)    289         batch_normalization_3[0][0]      
==================================================================================================
Total params: 162,978
Trainable params: 162,786
Non-trainable params: 192
__________________________________________________________________________________________________
