Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 128, 128, 1) 1248866     input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(1, None, 128, 128, 0           VAE-0[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (1, None, 128, 128,  0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(1, None, 128, 128, 0           VAE-0[0][0]                      
==================================================================================================
Total params: 1,248,866
Trainable params: 1,248,866
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv-layer-0 (CoordConv2D)      (None, 64, 64, 32)   896         input_2[0][0]                    
__________________________________________________________________________________________________
conv-layer-1 (CoordConv2D)      (None, 32, 32, 32)   9824        conv-layer-0[0][0]               
__________________________________________________________________________________________________
conv-layer-2 (CoordConv2D)      (None, 16, 16, 64)   19648       conv-layer-1[0][0]               
__________________________________________________________________________________________________
conv-layer-3 (CoordConv2D)      (None, 8, 8, 64)     38080       conv-layer-2[0][0]               
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 4096)         0           conv-layer-3[0][0]               
__________________________________________________________________________________________________
encoder-fc (Dense)              (None, 256)          1048832     encoder-flatten[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          32896       encoder-fc[0][0]                 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          32896       encoder-fc[0][0]                 
==================================================================================================
Total params: 1,183,072
Trainable params: 1,183,072
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 128)]        0                                            
__________________________________________________________________________________________________
spatial_broadcast_decoder (Spat (None, 136, 136, 130 0           input_3[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 134, 134, 32) 37472       spatial_broadcast_decoder[0][0]  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 132, 132, 32) 9248        conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 130, 130, 32) 9248        conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 32) 9248        conv2d_6[0][0]                   
__________________________________________________________________________________________________
decoder-image (Conv2D)          (None, 128, 128, 1)  289         conv2d_7[0][0]                   
__________________________________________________________________________________________________
decoder-raw-confidence (Conv2D) (None, 128, 128, 1)  289         conv2d_7[0][0]                   
==================================================================================================
Total params: 65,794
Trainable params: 65,794
Non-trainable params: 0
__________________________________________________________________________________________________
