Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 128, 128, 1) 1249634     input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 128, 128, 1) 1249634     input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(2, None, 128, 128, 0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (2, None, 128, 128,  0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(2, None, 128, 128, 0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
==================================================================================================
Total params: 2,499,268
Trainable params: 2,498,500
Non-trainable params: 768
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 1) 0                                            
__________________________________________________________________________________________________
conv-layer-0 (CoordConv2D)      (None, 64, 64, 32)   896         input_2[0][0]                    
__________________________________________________________________________________________________
CheckNumerics (TensorFlowOpLaye multiple             0           conv-layer-0[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2 (BatchNo (None, 64, 64, 32)   128         CheckNumerics[0][0]              
__________________________________________________________________________________________________
CheckNumerics_1 (TensorFlowOpLa multiple             0           batch_normalization_v2[0][0]     
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 64, 64, 32)   0           CheckNumerics_1[0][0]            
__________________________________________________________________________________________________
CheckNumerics_2 (TensorFlowOpLa multiple             0           leaky_re_lu[0][0]                
__________________________________________________________________________________________________
conv-layer-1 (CoordConv2D)      (None, 32, 32, 32)   9824        CheckNumerics_2[0][0]            
__________________________________________________________________________________________________
CheckNumerics_3 (TensorFlowOpLa multiple             0           conv-layer-1[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_1 (Batch (None, 32, 32, 32)   128         CheckNumerics_3[0][0]            
__________________________________________________________________________________________________
CheckNumerics_4 (TensorFlowOpLa multiple             0           batch_normalization_v2_1[0][0]   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 32, 32, 32)   0           CheckNumerics_4[0][0]            
__________________________________________________________________________________________________
CheckNumerics_5 (TensorFlowOpLa multiple             0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
conv-layer-2 (CoordConv2D)      (None, 16, 16, 64)   19648       CheckNumerics_5[0][0]            
__________________________________________________________________________________________________
CheckNumerics_6 (TensorFlowOpLa multiple             0           conv-layer-2[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_2 (Batch (None, 16, 16, 64)   256         CheckNumerics_6[0][0]            
__________________________________________________________________________________________________
CheckNumerics_7 (TensorFlowOpLa multiple             0           batch_normalization_v2_2[0][0]   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 16, 16, 64)   0           CheckNumerics_7[0][0]            
__________________________________________________________________________________________________
CheckNumerics_8 (TensorFlowOpLa multiple             0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
conv-layer-3 (CoordConv2D)      (None, 8, 8, 64)     38080       CheckNumerics_8[0][0]            
__________________________________________________________________________________________________
CheckNumerics_9 (TensorFlowOpLa multiple             0           conv-layer-3[0][0]               
__________________________________________________________________________________________________
batch_normalization_v2_3 (Batch (None, 8, 8, 64)     256         CheckNumerics_9[0][0]            
__________________________________________________________________________________________________
CheckNumerics_10 (TensorFlowOpL multiple             0           batch_normalization_v2_3[0][0]   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 8, 8, 64)     0           CheckNumerics_10[0][0]           
__________________________________________________________________________________________________
CheckNumerics_11 (TensorFlowOpL multiple             0           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 4096)         0           CheckNumerics_11[0][0]           
__________________________________________________________________________________________________
encoder-fc (Dense)              (None, 256)          1048832     encoder-flatten[0][0]            
__________________________________________________________________________________________________
CheckNumerics_12 (TensorFlowOpL multiple             0           encoder-fc[0][0]                 
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 256)          0           CheckNumerics_12[0][0]           
__________________________________________________________________________________________________
CheckNumerics_13 (TensorFlowOpL multiple             0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          32896       CheckNumerics_13[0][0]           
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          32896       CheckNumerics_13[0][0]           
==================================================================================================
Total params: 1,183,840
Trainable params: 1,183,456
Non-trainable params: 384
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 128)]        0                                            
__________________________________________________________________________________________________
spatial_broadcast_decoder (Spat (None, 136, 136, 130 0           input_3[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 134, 134, 32) 37472       spatial_broadcast_decoder[0][0]  
__________________________________________________________________________________________________
CheckNumerics_14 (TensorFlowOpL [(None, 134, 134, 32 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 132, 132, 32) 9248        CheckNumerics_14[0][0]           
__________________________________________________________________________________________________
CheckNumerics_15 (TensorFlowOpL [(None, 132, 132, 32 0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 130, 130, 32) 9248        CheckNumerics_15[0][0]           
__________________________________________________________________________________________________
CheckNumerics_16 (TensorFlowOpL [(None, 130, 130, 32 0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 32) 9248        CheckNumerics_16[0][0]           
__________________________________________________________________________________________________
CheckNumerics_17 (TensorFlowOpL [(None, 128, 128, 32 0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
CheckNumerics_18 (TensorFlowOpL [(None, 128, 128, 32 0           CheckNumerics_17[0][0]           
__________________________________________________________________________________________________
decoder-image (Conv2D)          (None, 128, 128, 1)  289         CheckNumerics_17[0][0]           
__________________________________________________________________________________________________
decoder-raw-confidence (Conv2D) (None, 128, 128, 1)  289         CheckNumerics_18[0][0]           
==================================================================================================
Total params: 65,794
Trainable params: 65,794
Non-trainable params: 0
__________________________________________________________________________________________________
