Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 28, 56, 1),  509794      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 28, 56, 1),  509794      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-2 (VAE)                     [(None, 28, 56, 1),  509794      input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(3, None, 28, 56, 1 0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
                                                                 VAE-2[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (3, None, 28, 56, 1) 0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(3, None, 28, 56, 1 0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
                                                                 VAE-2[0][0]                      
==================================================================================================
Total params: 1,529,382
Trainable params: 1,529,382
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 28, 56, 1)]  0                                            
__________________________________________________________________________________________________
conv-layer-0 (Conv2D)           (None, 14, 28, 32)   320         input_2[0][0]                    
__________________________________________________________________________________________________
conv-layer-1 (Conv2D)           (None, 7, 14, 64)    18496       conv-layer-0[0][0]               
__________________________________________________________________________________________________
conv-layer-2 (Conv2D)           (None, 4, 7, 128)    73856       conv-layer-1[0][0]               
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 3584)         0           conv-layer-2[0][0]               
__________________________________________________________________________________________________
encoder-last-fc (Dense)         (None, 32)           114720      encoder-flatten[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 16)           528         encoder-last-fc[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           528         encoder-last-fc[0][0]            
==================================================================================================
Total params: 208,448
Trainable params: 208,448
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 16)]         0                                            
__________________________________________________________________________________________________
decoder-first-fc (Dense)        (None, 3584)         60928       input_3[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 4, 7, 128)    0           decoder-first-fc[0][0]           
__________________________________________________________________________________________________
transp-conv-layer-0 (Conv2DTran (None, 8, 14, 128)   147584      reshape[0][0]                    
__________________________________________________________________________________________________
cropping2d (Cropping2D)         (None, 7, 14, 128)   0           transp-conv-layer-0[0][0]        
__________________________________________________________________________________________________
transp-conv-layer-1 (Conv2DTran (None, 14, 28, 64)   73792       cropping2d[0][0]                 
__________________________________________________________________________________________________
transp-conv-layer-2 (Conv2DTran (None, 28, 56, 32)   18464       transp-conv-layer-1[0][0]        
__________________________________________________________________________________________________
decoder-image (Conv2DTranspose) (None, 28, 56, 1)    289         transp-conv-layer-2[0][0]        
__________________________________________________________________________________________________
decoder-raw-confidence (Conv2DT (None, 28, 56, 1)    289         transp-conv-layer-2[0][0]        
==================================================================================================
Total params: 301,346
Trainable params: 301,346
Non-trainable params: 0
__________________________________________________________________________________________________
