Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
VAE-0 (VAE)                     [(None, 28, 28, 1),  369250      input_1[0][0]                    
__________________________________________________________________________________________________
VAE-1 (VAE)                     [(None, 28, 28, 1),  369250      input_1[0][0]                    
__________________________________________________________________________________________________
packed (TensorFlowOpLayer)      [(2, None, 28, 28, 1 0           VAE-0[0][1]                      
                                                                 VAE-1[0][1]                      
__________________________________________________________________________________________________
softmax (Softmax)               (2, None, 28, 28, 1) 0           packed[0][0]                     
__________________________________________________________________________________________________
packed_1 (TensorFlowOpLayer)    [(2, None, 28, 28, 1 0           VAE-0[0][0]                      
                                                                 VAE-1[0][0]                      
==================================================================================================
Total params: 738,500
Trainable params: 737,732
Non-trainable params: 768
__________________________________________________________________________________________________
Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv-layer-0 (CoordConv2D)      (None, 14, 14, 32)   896         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v2 (BatchNo (None, 14, 14, 32)   128         conv-layer-0[0][0]               
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 14, 14, 32)   0           batch_normalization_v2[0][0]     
__________________________________________________________________________________________________
conv-layer-1 (CoordConv2D)      (None, 7, 7, 32)     9824        leaky_re_lu[0][0]                
__________________________________________________________________________________________________
batch_normalization_v2_1 (Batch (None, 7, 7, 32)     128         conv-layer-1[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 7, 7, 32)     0           batch_normalization_v2_1[0][0]   
__________________________________________________________________________________________________
conv-layer-2 (CoordConv2D)      (None, 4, 4, 64)     19648       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_v2_2 (Batch (None, 4, 4, 64)     256         conv-layer-2[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 4, 4, 64)     0           batch_normalization_v2_2[0][0]   
__________________________________________________________________________________________________
conv-layer-3 (CoordConv2D)      (None, 2, 2, 64)     38080       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_v2_3 (Batch (None, 2, 2, 64)     256         conv-layer-3[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 2, 2, 64)     0           batch_normalization_v2_3[0][0]   
__________________________________________________________________________________________________
encoder-flatten (Flatten)       (None, 256)          0           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
encoder-fc (Dense)              (None, 256)          65792       encoder-flatten[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 256)          0           encoder-fc[0][0]                 
__________________________________________________________________________________________________
dense (Dense)                   (None, 256)          65792       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          65792       leaky_re_lu_4[0][0]              
==================================================================================================
Total params: 266,592
Trainable params: 266,208
Non-trainable params: 384
__________________________________________________________________________________________________
Model: "decoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 256)]        0                                            
__________________________________________________________________________________________________
spatial_broadcast_decoder (Spat (None, 36, 36, 258)  0           input_3[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 34, 34, 32)   74336       spatial_broadcast_decoder[0][0]  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 32)   9248        conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 30, 30, 32)   9248        conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 28, 28, 32)   9248        conv2d_6[0][0]                   
__________________________________________________________________________________________________
decoder-image (Conv2D)          (None, 28, 28, 1)    289         conv2d_7[0][0]                   
__________________________________________________________________________________________________
decoder-raw-confidence (Conv2D) (None, 28, 28, 1)    289         conv2d_7[0][0]                   
==================================================================================================
Total params: 102,658
Trainable params: 102,658
Non-trainable params: 0
__________________________________________________________________________________________________
